{"timeLimit":2000,"input":"В единственной строке ввода находятся два целых числа $N$ и $K$ ($1 \\leqslant N \\leqslant 10^{15}$, $1 \\leqslant K \\leqslant 10$).","sampleTests":[{"input":"9 2\n","output":"4\n"},{"input":"12 3\n","output":"2\n"}],"legend":"\\epigraph{\\textit{Половина жителей страны A никогда не читали газет. Половина не участвовали в выборах президента. Остается только надеяться, что эта одна и та же половина.}}{-- Гор Видал}\n\nСкоро в Соединенных Штатах Берляндии пройдут выборы президента. На эту ответственную должность претендуют два кандидата: Дядя Сэм и Дядя Фродо. Вы работаете аналитиком в предвыборном штабе Дяди Сэма и вам поручено помочь ему победить конкурента. Раздуть газетный скандал из одержимости оппонента бросанием колец в жерла вулканов не получилось, так что придётся воспользоваться математикой. \n\nКазалось бы, чтобы выиграть, необходимо убедить проголосовать за нашего кандидата более половины пришедших на выборы. Оказывается, что иногда нужно гораздо меньше! Для того чтобы понять, как это возможно, рассмотрим подробнее процедуру голосования.\n\nКак вы знаете, Соединенные Штаты Берляндии разделены на несколько административных регионов первого уровня~--- штатов. Сначала в каждом из штатов проходят местные выборы, по итогам которых каждый штат отдаёт свой голос за одного из кандидатов. Если \\textbf{не менее половины} штатов выбрало Дядю Сэма, то выигрывает он, иначе побеждает Дядя Фродо. Все штаты в свою очередь состоят из административных регионов второго уровня, каждый из которых состоит из административных регионов третьего уровня, и так далее. Всего в Берляндии существует $K$ уровней административных единиц, последним из которых является один цельный житель Берляндии, которых в стране $N$. Одним из ключевых принципов Берляндии является равенство, так что любой регион $i$-го уровня делится на одинаковое число регионов следущего уровня.\n\nТак получилось, что разделением на регионы поручили заняться именно вам, то есть в ваших руках назначить на сколько именно административных единиц $i$-го уровня делится $(i - 1)$-ая административная единица.\n\nТакже у вас есть сильный инструмент влияния на выбор людей~--- нефтяные бурли. Чтобы заставить одного избирателя отдать свой голос за Дядю Сема, достаточно дать ему скромный подарок в размере одного нефтяного бурля. \n\nК несчастью, изначально все $N$ жителей Соединённых Штатов Берляндии собираются отдать свой голос за Дядю Фродо. Требуется определить минимальное количество нефтяных бурлей, которое требуется потратить для победы на выборах.","outputFile":"stdout","name":"Выборы","authorName":"Gleb Evstropov","inputFile":"stdin","tutorial":"","language":"russian","notes":"Берляндские законы не запрещают, чтобы страна состояла из одного штата, или город из одного жителя. Аналогично с остальными типами регионов. \n\n\n\\begin{figure}[!h] \n\\centering\n  \\includegraphics[width=.4\\linewidth]{pic-1.eps}\\phantom{aaaa} \n  \\includegraphics[width=.4\\linewidth]{pic-2.eps}\n\\caption{Пояснения к тестам из условия.}\n\\label{fig1}\n\\end{figure}\n\nНа рисунке \\ref{fig1} черным цветом отмечены те регионы, в которых победил Дядя Сэм. На нижнем уровне черными изображены вершины, соответствущие подкупленным жителям.\n\n\\Scoring\n\nТесты к этой задаче состоят из семи групп. Баллы за~каждую группу ставятся только при прохождении всех тестов группы и \\textbf{всех тестов предыдущих} групп. \\textbf{Offline-проверка} означает, что результаты тестирования вашего решения на данной группе станут доступны только после окончания соревнования.\n\\medskip\n\n\\begingroup\n\\renewcommand{\\arraystretch}{1.5}\n\n\\begin{tabular}{|c|c|c|c|c|c|}\n\\hline\n& & & \\multicolumn{2}{c|}{Дополнительные ограничения} & \\\\\n\\cline{4-5}\n\\raisebox{2.25ex}[0cm][0cm]{Группа} & \n\\raisebox{2.25ex}[0cm][0cm]{Тесты} &\n\\raisebox{2.25ex}[0cm][0cm]{Баллы} &\n$N$ & $K$  & \\raisebox{2.25ex}[0cm][0cm]{Комментарий} \\\\\n\\hline\n0 & 1--2 & 0  & --                & --                 & Тесты из условия. \\\\\n\\hline\n1 & 3--12 & 20 & $N \\leq 1\\,000$       & $K \\leq 2$        &  \\\\\n\\hline\n2 & 13--26 & 20 & $N \\leq 1\\,000$     & --      &                    \\\\\n\\hline\n3 & 27--46 & 20 & $N \\leq 1\\,000\\,000$     & --   &\\ \\\\\n\\hline\n4 & 47--66 & 15 & $N \\leq 10^{11}$     & --   &\\ \\textbf{Offline-проверка.} \\\\\n\\hline\n5 & 67--86 & 10 & $N \\leq 10^{13}$     & --   &\\ \\textbf{Offline-проверка.} \\\\\n\\hline\n6 & 87--106 & 15 & --     & --   &\\ \\textbf{Offline-проверка.} \\\\\n\\hline\n\\end{tabular}\n\n\\endgroup","output":"Требуется вывести единственное число~--- минимальное количество нефтяных бурлей, которое придётся потратить на предвыборные подарки при наилучшем разбиении на регионы.","authorLogin":"glebshp","memoryLimit":536870912}
