{"timeLimit":15000,"input":"В первой строке входных данных следуют два целых числа $N$ и $M$ ($2 \\leq N \\leq 100\\,000$, $1 \\leq M \\leq 1\\,000\\,000$), обозначающие количество кабинетов и количество коридоров в НИИЧАВО.\n\nВ последующих $M$ строках находятся описания коридоров. Каждая строка содержит по три целых числа $u_i$, $v_i$, $t_i$~--- номера двух кабинетов, соединённых $i$-ым коридором, и значение температуры в этом коридоре, выраженное в градусах ($1 \\leq u_i, v_i \\leq N$, $-10^9 \\leq t_i \\leq 10^9$). Как вы уже могли понять, НИИЧАВО --- весьма необычное заведение, поэтому между двумя кабинетами может пролегать несколько коридоров, возможно с разными температурами, а некоторые коридоры могут соединять кабинет с самим собой. Гарантируется, что коридоры перечислены во входном файле в порядке \\textbf{неубывания} $t_i$.\n\nВ следующей строке находится целое число $Q$ ($1 \\leq Q \\leq 10$) --- количество наборов данных, которые вам требуется обработать.\n\nВ каждой из последующих $Q$ строк находится по три целых числа $A_i$, $B_i$, $D_i$, обозначающих номер кабинета Корнеева, номер кабинета, в котором расположена лаборатория, и максимальный допустимый перепад температур для дивана-транслятора в градусах ($1 \\leq A_i, B_i \\leq N$, $A_i \\neq B_i$, $0 \\leq D_i \\leq 2 \\cdot 10^9$).","sampleTests":[{"input":"6 8\n1 2 4\n2 3 6\n3 2 7\n6 1 11\n2 5 12\n1 3 14\n3 4 16\n5 6 17\n3\n1 5 5\n4 2 4\n4 2 6\n","output":"4\n-1\n5\n"}],"legend":"В научно-исследовательском институте чародейства и волшебства пожар! Во время опыта Корнеева В. П. по превращению всей морской и океанской воды планеты в живую воду произошло короткое замыкание, и теперь его кабинет объят пламенем. Задача первостепенной важности --- спасти из огня ценные лабораторные приборы, в особенности единственный в своём роде диван-транслятор М-поля. Ваша задача --- перенести диван-транслятор из кабинета Корнеева в запасную лабораторию изучения М-поля.\n\nНИИЧАВО состоит из $N$ кабинетов, соединённых $M$ коридорами. Кабинеты пронумерованы целыми числами от $1$ до $N$, при этом кабинет Корнеева имеет номер $A$, а лаборатория изучения М-поля расположена в кабинете номер $B$. Благодаря специальному искажению пространства внутри института, все коридоры имеют одинаковую длину, которую можно пройти за $1$ минуту, если двигаться быстрым шагом.\n\nСитуация усугубляется тем, что диван-транслятор --- прибор, очень чувствительный к резким перепадам температуры. Внутри каждого коридора НИИЧАВО поддерживается свой температурный режим. Если абсолютная величина разности температур в двух \\textbf{последовательных} коридорах на пути из кабинета Корнеева в лабораторию окажется больше $D$ градусов, то диван-транслятор перейдёт в нестабильное состояние, что может привести к катастрофическим последствиям. Обратите внимание, что на своём пути вы не заходите в сами кабинеты, а только переходите из коридора в коридор, поэтому климат внутри кабинетов не влияет на диван-транслятор. В силу причин магического характера, войдя в коридор, вы обязаны дойти до его конца, иными словами, останавливаться или разворачиваться посреди коридора запрещено. По каждому коридору можно перемещаться в обоих направлениях.\n\nОпределите, за какое минимальное время можно добраться из кабинета Корнеева до запасной лаборатории, не допуская резкого перепада температур. В рамках данной задачи вам предлагается ответить на поставленный вопрос для нескольких наборов значений $A$, $B$ и $D$.","outputFile":"stdout","name":"Пожар в НИИЧАВО","authorName":"Gleb Evstropov","inputFile":"stdin","tutorial":"","language":"russian","notes":"Пояснение к первому тесту из условия.\n\nВ первом наборе $A = 1$, $B = 5$, $D = 5$. В качестве возможного маршрута может выступить следующая последовательность переходов по коридорам: \n$1 \\xrightarrow{t = 4^\\circ} \n 2 \\xrightarrow{t = 6^\\circ} \n 3 \\xrightarrow{t = 7^\\circ} \n 2 \\xrightarrow{t = 12^\\circ} \n 5$.\n\nВо втором наборе $A = 4$, $B = 2$, $D = 4$. Способа добраться из кабинета $4$ в кабинет $2$, ни разу не допустив перепад температуры больше, чем в $4$ градуса, не существует.\n\nВ третьем наборе $A = 4$, $B = 2$, $D = 7$. Стартовый и конечный кабинет те же, что и в предыдущем наборе, но допустимый перепад температуры больше, благодаря чему подходит следующий маршрут: \n$4 \\xrightarrow{t = 16^\\circ}\n 3 \\xrightarrow{t = 14^\\circ}\n 1 \\xrightarrow{t = 11^\\circ}\n 6 \\xrightarrow{t = 17^\\circ}\n 5 \\xrightarrow{t = 12^\\circ}\n 2$.\n\n\\Scoring\n\nТесты к этой задаче состоят из дохерищи групп. Баллы за~каждую группу ставятся только при прохождении всех тестов группы и \\textbf{всех тестов предыдущих} групп. \\textbf{Offline-проверка} означает, что результаты тестирования вашего решения на данной группе станут доступны только после окончания соревнования.\n\n\n\\medskip\n\n\\begingroup\n\\renewcommand{\\arraystretch}{1.5}\n\n\\begin{tabular}{|c|c|c|c|c|c|c|}\n\\hline\n& & & \\multicolumn{3}{c|}{Дополнительные ограничения} & \\\\\n\\cline{4-6}\n\\raisebox{2.25ex}[0cm][0cm]{Группа} & \n\\raisebox{2.25ex}[0cm][0cm]{Тесты} &\n\\raisebox{2.25ex}[0cm][0cm]{Баллы} &\n$N$ & $M$ & $Q$ & \\raisebox{2.25ex}[0cm][0cm]{Комментарий} \\\\\n\\hline\n0 & ?--?   & 0  & --            & --            & --              & Тесты из условия. \\\\\n\\hline\n1 & ??--??  & 30 & --    & --    & --  &                  \\\\\n\\hline\n2 & ??--?? & 30 & --    & --    & --              &                  \\\\\n\\hline\n3 & ??--?? & hz & --    & --            & --              & \\textbf{Offline-проверка.}                 \\\\\n\\hline\n4 & ??--?? & hz & --            & --            & --              & \\textbf{Offline-проверка.} \\\\\n\\hline\n\\end{tabular}\n\n\\endgroup","output":"Для каждого набора данных выведите в отдельной строке минимальное количество минут, которое требуется потратить, чтобы добраться из кабинета Корнеева до лаборатории, либо выведите $-1$, если сделать это, используя допустимый для дивана-транслятора маршрут, невозможно.","authorLogin":"glebshp","memoryLimit":536870912}
